УчетВУправляющихДляГит1/src/InformationRegisters/УдалитьВычетыПоДоходамНДФЛ/УдалитьВычетыПоДоходамНДФЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УдалитьВычетыПоДоходамНДФЛ</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>ГодовойВычет</name>
    <comment>Сумма вычета по коду дохода за год</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормативЗатрат</name>
    <comment>Норматив затрат в процентах от суммы дохода по авторским вознаграждениям, размер вычета по каждому случаю выплаты иных доходов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КодДохода</name>
    <type>
      <types>CatalogRef.УдалитьВидыДоходовНДФЛ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/ВычетыПоДоходамНДФЛ/ВычетыПоДоходамНДФЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВычетыПоДоходамНДФЛ</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>ГодовойВычет</name>
    <comment>Сумма вычета по коду дохода за год</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормативЗатрат</name>
    <comment>Норматив затрат в процентах от суммы дохода по авторским вознаграждениям, размер вычета по каждому случаю выплаты иных доходов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КодДохода</name>
    <type>
      <types>CatalogRef.ВидыДоходовНДФЛ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/Catalogs/ВидыДоходовНДФЛ/ВидыДоходовНДФЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыДоходовНДФЛ</name>
  <predefined>
    <items>
      <name>Код1010</name>
      <description>Дивиденды</description>
    </items>
    <items>
      <name>Код1211</name>
      <description>Доходы, полученные в виде сумм страховых взносов по договорам страхования, если указанные суммы вносятся за физических лиц из средств работодателей</description>
    </items>
    <items>
      <name>Код1300</name>
      <description>Доходы, полученные налогоплательщиком от использования в РФ авторских или иных смежных прав (кроме авторских вознаграждений)</description>
    </items>
    <items>
      <name>Код1530</name>
      <description>Доходы, полученные по операциям купли-продажи ценных бумаг, обращающихся на организованном рынке ценных бумаг</description>
    </items>
    <items>
      <name>Код1531</name>
      <description>Доходы, полученные по операциям купли-продажи ценных бумаг, не обращающихся на организованном рынке ценных бумаг</description>
    </items>
    <items>
      <name>Код1532</name>
      <description>Доходы, полученные по операциям с финансовыми инструментами срочных сделок, базисным активом по которым являются ценные бумаги или фондовые индексы</description>
    </items>
    <items>
      <name>Код1533</name>
      <description>Доходы, полученные от продажи и погашения инвестиционных паев паевых инвестиционных фондов</description>
    </items>
    <items>
      <name>Код1535</name>
      <description>Доходы, полученные по операциям с финансовыми инструментами срочных сделок, базисным активом которых не являются ценные бумаги или фондовые индексы</description>
    </items>
    <items>
      <name>Код1536</name>
      <description>Доход полученные по операциям купли-продажи ценных бумаг, не обращающихся на организованном рынке ценных бумаг, но отвечавших его требованиям</description>
    </items>
    <items>
      <name>Код1537</name>
      <description>Доходы в виде процентов по займу, полученные по совокупности операций РЕПО</description>
    </items>
    <items>
      <name>Код1538</name>
      <description>Доходы в виде процентов, полученные в налоговом периоде по совокупности договоров займа</description>
    </items>
    <items>
      <name>Код1539</name>
      <description>Доходы по операциям, связанным с открытием короткой позиции, являющимся объектом операций РЕПО</description>
    </items>
    <items>
      <name>Код1541</name>
      <description>Доходы, получаемые в результате обмена ценных бумаг, переданных по первой части РЕПО</description>
    </items>
    <items>
      <name>Код1543</name>
      <description>Доходы по операциям, учитываемым на индивидуальном инвестиционном счете</description>
    </items>
    <items>
      <name>Код1544</name>
      <description>Доходы по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг, учитываемым на индивидуальном инвестиционном счете</description>
    </items>
    <items>
      <name>Код1545</name>
      <description>Доходы по операциям с ценными бумагами, не обращающимися на организованном рынке ценных бумаг, учитываемым на индивидуальном инвестиционном счете</description>
    </items>
    <items>
      <name>Код1546</name>
      <description>Доходы по опер. с произв.фин-выми инстр-ми, обр-ся на орг.рынке и базисным активом кот.явл. цен.бум., фонд.индексы и пр., учит. на инд. инвест.счете</description>
    </items>
    <items>
      <name>Код1547</name>
      <description>Доходы по операциям с производными финансовыми инструментами, не обращающимися на орг. рынке ценных бумаг, учитываемым на индивидуальном инвест.счете</description>
    </items>
    <items>
      <name>Код1548</name>
      <description>Доходы по опер. с произв.фин-выми инстр., обр-ся на орг.рынке и базисным активом кот. не явл. цен.бум., фонд.индексы и пр., учит. на инд.инвест.счете</description>
    </items>
    <items>
      <name>Код1549</name>
      <description>Доходы по опер. с ценными бум., не обр-ся на орг.рынке ц.бумаг, кот. при приобретении отвечали треб-ям для обр-хся ц.бум., учит. на инд. инвест.счете</description>
    </items>
    <items>
      <name>Код1551</name>
      <description>Доходы в виде процентов по займу, полученные по совокупности операций РЕПО, учитываемых на индивидуальном инвестиционном счете</description>
    </items>
    <items>
      <name>Код1552</name>
      <description>Доходы в виде процентов, полученных в налоговом периоде по совокупности договоров займа, учитываемых на индивидуальном инвестиционном счете</description>
    </items>
    <items>
      <name>Код1553</name>
      <description>Доходы по операциям, связанным с открытием короткой позиции, являющимся объектом операций РЕПО, учитываемых на индивидуальном инвестиционном счете</description>
    </items>
    <items>
      <name>Код1554</name>
      <description>Доходы, получаемые в результате обмена ценных бумаг, переданных по первой части РЕПО, учитываемых на индивидуальном инвестиционном счете</description>
    </items>
    <items>
      <name>КодДоходаПоУмолчанию</name>
      <description>Вознаграждение за выполнение трудовых или иных обязанностей; денежное содержание и иные налогооблагаемые выплаты военнослужащим и приравненным к ним</description>
    </items>
    <items>
      <name>Код2002</name>
      <description>Суммы премий за производственные результаты, предусмотренные зак-вом РФ, трудовыми (коллективными) договорами кроме доходов с кодом 2003</description>
    </items>
    <items>
      <name>Код2003</name>
      <description>Суммы вознаграждений, выплачиваемых за счет средств прибыли организации, средств специального назначения или целевых поступлений</description>
    </items>
    <items>
      <name>Код2010</name>
      <description>Выплаты по договорам гражданско-правового характера (за исключением авторских вознаграждений)</description>
    </items>
    <items>
      <name>Код2013</name>
      <description>Сумма компенсации за неиспользованный отпуск</description>
    </items>
    <items>
      <name>Код2014</name>
      <description>Сумма выплаты в виде выходного пособия, среднего месячного заработка, превышающей 3-х кратный размер среднего заработка</description>
    </items>
    <items>
      <name>Код2201</name>
      <description>Авторские вознаграждения (вознаграждения) за создание литературных произведений, в том числе для театра, кино, эстрады и цирка</description>
    </items>
    <items>
      <name>Код2202</name>
      <description>Авторские вознаграждения (вознаграждения) за создание художественно-графических произведений, фоторабот для печати, произведений архитектуры и дизайна</description>
    </items>
    <items>
      <name>Код2203</name>
      <description>Авторские вознаграждения (вознаграждения) за создание произведений скульптуры, живописи, театрально- и кинодекорационного искусства и графики</description>
    </items>
    <items>
      <name>Код2204</name>
      <description>Авторские вознаграждения (вознаграждения) за создание аудиовизуальных произведений (видео-, теле- и кинофильмов)</description>
    </items>
    <items>
      <name>Код2205</name>
      <description>Авторские за создание музыкальных произведений: музыкально-сценических, симфонических, хоровых, камерных, для духового оркестра, для фильмов и театра</description>
    </items>
    <items>
      <name>Код2206</name>
      <description>Авторские вознаграждения (вознаграждения) за создание других музыкальных произведений, в том числе подготовленных к опубликованию</description>
    </items>
    <items>
      <name>Код2207</name>
      <description>Авторские вознаграждения (вознаграждения) за исполнение произведений литературы и искусства</description>
    </items>
    <items>
      <name>Код2208</name>
      <description>Авторские вознаграждения (вознаграждения) за создание научных трудов и разработок</description>
    </items>
    <items>
      <name>Код2209</name>
      <description>Авторские вознаграждения за открытия, изобретения, промышленные образцы</description>
    </items>
    <items>
      <name>Код2210</name>
      <description>Вознаграждение, выплачиваемое наследникам (правопреемникам) авторов произведений науки, литературы, искусства, открытий, изобретений и пром. образцов</description>
    </items>
    <items>
      <name>Код2610</name>
      <description>Материальная выгода, полученная от экономии на процентах за пользование заемными (кредитными) средствами </description>
    </items>
    <items>
      <name>Код2720</name>
      <description>Стоимость подарков</description>
    </items>
    <items>
      <name>Код2730</name>
      <description>Стоимость призов в денежной и натуральной форме на конкурсах и соревнованиях, проводимых в соотв. с решениями Правительства РФ и др. органов власти</description>
    </items>
    <items>
      <name>Код2740</name>
      <description>Стоимость выигрышей и призов, получаемых в проводимых конкурсах, играх и других мероприятиях в целях рекламы товаров, работ и услуг</description>
    </items>
    <items>
      <name>Код2760</name>
      <description>Материальная помощь, оказываемая работодателями своим работникам, а также бывшим своим работникам, уволившимся в связи с выходом на пенсию</description>
    </items>
    <items>
      <name>Код2761</name>
      <description>Материальная помощь, оказываемая инвалидам общественными организациями инвалидов</description>
    </items>
    <items>
      <name>Код2762</name>
      <description>Материальная помощь, оказываемая работодателями своим работникам при рождении (усыновлении) ребенка</description>
    </items>
    <items>
      <name>Код2770</name>
      <description>Возмещение (оплата) работодателями своим работникам и членам их семьи, бывшим своим работникам-пенсионерам, а также инвалидам стоимости медикаментов</description>
    </items>
    <items>
      <name>Код2790</name>
      <description>Сумма помощи (в денежной и натуральной форме), стоимость подарков, полученных ветеранами, инвалидами Великой Отечественной войны и приравненных к ним</description>
    </items>
    <items>
      <name>Код2791</name>
      <description>Доходы, полученные работниками в натуральной форме в качестве оплаты труда от с/х товаропроизводителей, упл-х ЕСХН, и крестьянских х-в</description>
    </items>
    <items>
      <name>Код4800</name>
      <description>Иные доходы</description>
    </items>
    <items>
      <name>Код2510</name>
      <description>Оплата за налогоплательщика товаров, работ, услуг или имущественных прав, в том числе коммунальных услуг, питания, отдыха, обучения в его интересах</description>
    </items>
    <items>
      <name>Код2520</name>
      <description>Доход, полученный налогоплательщиком в натуральной форме, в виде полной или частичной оплаты товаров, выполненных в его интересах работ, услуг.</description>
    </items>
    <items>
      <name>Код2530</name>
      <description>Оплата труда в натуральной форме</description>
    </items>
  </predefined>
  <attributes>
    <name>СтавкаНалогообложенияРезидента</name>
    <type>
      <types>EnumRef.НДФЛСтавкиНалогообложенияРезидента</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОблагаетсяУНалоговогоАгента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПрименяемыйВНалоговойОтчетностиС2010Года</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВычетРассчитываетсяАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВычетПоУмолчанию</name>
    <type>
      <types>CatalogRef.ВидыВычетовНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетЕдинственныйВычет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетОплатеТруда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/InformationRegisters/УдалитьВычетыПоДоходамНДФЛ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет первоначальное заполнение сведений.
Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьВычетыПоДоходамНДФЛ();
	
КонецПроцедуры

// Выполняет заполнение справочника "ВидыДоходовНДФЛ".
//
Процедура ЗаполнитьВычетыПоДоходамНДФЛ()
	
	ВидыДоходовНДФЛ = Справочники.ВидыДоходовНДФЛ;
	
	// РАЗМЕРЫ СКИДОК К ДОХОДАМ
	
	НаборЗаписей = РегистрыСведений.ВычетыПоДоходамНДФЛ.СоздатьНаборЗаписей();
	НаборЗаписей.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
	
	ДатаСведений = '20100101';
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код1211, 12000, 0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2201, 0,	 20);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2202, 0,	 30);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2203, 0,	 40);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2204, 0,	 30);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2205, 0,	 40);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2206, 0,	 25);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2207, 0,	 20);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2208, 0,	 20);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2209, 0,	 30);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2720, 4000, 0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2730, 4000, 0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2740, 4000, 0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2760, 4000, 0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2761, 4000, 0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2762, 0, 50000);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2770, 4000, 0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2790, 10000, 0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2791, 0, 4300);
	
	// Запишем набор записей в режиме добавления.
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры 

// Добавляет запись в набор записей регистра "ВычетыПоДоходамНДФЛ".
//
Процедура ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, КодДохода, ГодовойВычет, НормативЗатрат) 

	НоваяЗапись = НаборЗаписей.Добавить();

	НоваяЗапись.Период         = ДатаСведений;
	НоваяЗапись.КодДохода      = КодДохода;
	НоваяЗапись.ГодовойВычет   = ГодовойВычет;
	НоваяЗапись.НормативЗатрат = НормативЗатрат;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
